![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [1]:
import pandas as pd

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

In [2]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [3]:
type(df)

pandas.core.frame.DataFrame

2. Tạo ra 1 DataFrame từ dict

In [7]:
dic= {'name':['Cuong','Mai','Pha','Nghia'],
      'age':[18,19,24,30],
      'university':['MIT','Havard','NYU','Yonsei']}

df1= pd.DataFrame(dic, index=[f'student{i}' for i in range (1,5)])
df1

           name  age university
student1  Cuong   18        MIT
student2    Mai   19     Havard
student3    Pha   24        NYU
student4  Nghia   30     Yonsei

3. Tạo ra 1 DataFrame từ list của list

In [9]:
li= [['Cuong',18,'MIT'],['Mai',19,'Harvard'],['Pha',24,'NYU'],['Nghia',30,'Yonsei']]

df2= pd.DataFrame(li, columns= ['name','age','university'])
df2

    name  age university
0  Cuong   18        MIT
1    Mai   19    Harvard
2    Pha   24        NYU
3  Nghia   30     Yonsei

4. Tạo ra 1 DataFrame từ zip

In [20]:
name = ['Cuong','Mai','Pha','Nghia']
age = [18,19,24,30]
university = ['MIT','Havard','NYU','Yonsei']

df3= pd.DataFrame(list(zip(name, age, university)))
df3

       0   1       2
0  Cuong  18     MIT
1    Mai  19  Havard
2    Pha  24     NYU
3  Nghia  30  Yonsei

5. Tạo từ 1 chuỗi numpy

In [16]:
import numpy as np
df4 = pd.DataFrame(np.linspace(1,16,16).reshape(4,4))
df4

      0     1     2     3
0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0
2   9.0  10.0  11.0  12.0
3  13.0  14.0  15.0  16.0

#### 2.1.2 How to create a Series

In [22]:
pd.Series({'name':['Cuong','Mai','Pha','Nghia']})

name    [Cuong, Mai, Pha, Nghia]
dtype: object

In [23]:
df2['name']

0    Cuong
1      Mai
2      Pha
3    Nghia
Name: name, dtype: object

In [24]:
df2.name

0    Cuong
1      Mai
2      Pha
3    Nghia
Name: name, dtype: object

### 2.2 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

pd.read_(ten kieu file): pd.read_csv()   pd.read_excel()
pd.to_(ten kieu file):  pd.to_csv()   pd.to_excel()

.csv: commas separated value
.tsv: tab separated value
.txt

In [26]:
df= pd.read_csv('Ecommerce Purchases')
df.head(5)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\r\nAlexisborough, NE ...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\r\nSouth John, TN...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\r\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\r\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\r\nNew Cynthia, TX...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [27]:
df.tail(5)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
9995,"966 Castaneda Locks\r\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\r\nNorth Edwardburgh,...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\r\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\r\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\r\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

In [28]:
df.sample(5)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
488,6746 Abigail Manor Suite 606\r\nEast Davidmout...,94 EY,PM,Mozilla/5.0 (iPod; U; CPU iPhone OS 4_0 like M...,Williams-Rowe,869900331381955,06/19,393,American Express,murphyjames@yahoo.com,Geochemist,107.88.148.190,el,17.13
2224,USCGC Quinn\r\nFPO AP 88320,74 Yk,PM,Mozilla/5.0 (Macintosh; PPC Mac OS X 10_7_2; r...,Juarez Inc,3158895825500926,06/17,399,Mastercard,ellischristopher@gmail.com,Ambulance person,116.12.99.115,zh,36.76
6316,"2223 Karen Island Apt. 691\r\nDelgadostad, NY ...",74 mN,AM,Mozilla/5.0 (X11; Linux i686) AppleWebKit/5331...,Lambert Group,3337995831380596,08/23,76,VISA 13 digit,michaelevans@gmail.com,Diagnostic radiographer,50.140.171.183,de,59.39
6118,"665 Scott Villages\r\nNorth Rachel, MO 70319",74 Jh,AM,Mozilla/5.0 (Macintosh; U; PPC Mac OS X 10_5_4...,"Goodman, Fisher and Larson",30349060920944,12/16,779,JCB 15 digit,caitlinmurray@novak.org,"Engineer, production",147.209.128.53,fr,0.80
3084,"079 Romero Brook\r\nNorth Danielmouth, IN 8082...",55 Bn,PM,Mozilla/5.0 (compatible; MSIE 6.0; Windows 95;...,"Anderson, Ramirez and Phillips",5399023457578615,10/16,549,JCB 15 digit,christinabradley@yahoo.com,Clinical cytogeneticist,172.91.99.140,fr,3.20

In [32]:
iris= pd.read_csv('iris.data')
iris.head(5)

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [34]:
import seaborn as sns
iris1 = sns.load_dataset('iris')
iris1.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [35]:
iris1.to_csv('huongtnl_iris')

### 2.3 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

### 2.4 Masking

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)